app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "description", "image", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @category = Category.new(category_params)
    @category.user_id = current_user.id
    if @category.save