app/controllers/transactions_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."category_id" = $1 ORDER BY "transactions"."created_at" ASC  [["category_id", 5]]
SELECT SUM("transactions"."price") FROM "transactions" WHERE "transactions"."category_id" = $1  [["category_id", 5]]
---
  def index
    category = Category.includes(:transactions).find(params[:category_id])
    @transactions = category.transactions.order(:created_at)
    @total = category.transactions.sum(:price)

INSERT INTO "transactions" ("name", "price", "image", "description", "created_at", "updated_at", "category_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @transaction = Transaction.new(transaction_params)
    @transaction.category_id = params[:category_id]
    if @transaction.save!